package o1_ProgrammingByBook.Chapter_1_LetsProgram.a2_AnalyzeFirstProgram;

// Сега анализираме кода на програмата. Първата инструкция е
import javax.swing.*; // е неоходима, за да може да
// използван в програмата класът JOptionPane от библиотеката Swing.

/*
* Библиотека Swing съдържа набор от класове за разработване на приложения с графичен интерфейс. Тя е
* неотменна част от платформата на Java. С библиотеката Swing ще се запознаем отблизо малко по-късно
* когато ще разгледаме създаването на приложения с графичен интерфейс.
*
* ДИалговоия прозорец на нашата програма се показва с помощта на метода showMessageDialog(). Това е статичен
* метод на класа JOptionPane - с други думи, методът е дефиниран в този клас и да се говори за метод
* showMessageDialog() извън контекта на класа JOptionPane просто няма смисъл.
*
* При извикване на един метод се изпълнява определен блок от програмен код или съвкупност от команди.
* В конкретния случай дори не е важна какви конкретно команди се изпълняват при извикването на метод
* showMessageDialog(), а е важен резултатът - създава се и се покзва диалогов прозорец. Т.е ние просто
* използваме един вече съществуващ метод, създаден не от нас.
* Методите биват статични и обикновени, или нестатични. Ако методът е обикновен (нестатичен), тогава той се
* извиква от обекта. Засега такива методи не ни интересуват. Статичните методи се извикват от класа, в
* който те са дефинирани. С други думи, при извикване на статичен метод е необходимо да бъде указан класът
* в който е дефиниран методът showMessageDialog() e дефиниранв клака JOptionPane на свой ред влиза в състава
* на библиотеката Swing.
*
* В общия случай инстукцията import се използва за импортиране /добавяне/ в програмата на всевъзможни полезни
* инструменти - обикновено класове. При това след инструкцията import се задава не просто името на импортирания
* клас, а пълния път към него, покзващ йерархията на пакетите чак до мястото в което се намира класът.
* В частност, изразът javax.swing.JOptionPane означава, че класът JOptionPane влиза в пакета swing, който е
* подпакет на пакета javax.
* Целия останал код отпрограмата представлява дефиниране на класа ShowMeAWindowDemo. Аефинирането на класа
* започва с ключова дума class, след която следва името на класа. Изразът class ShowMeAWindowDemo, например
* означава , че се дефинира клас с името ShowMeAWindowDemo. */

public class Analyze {
    public static void main(String[] args) {
        JOptionPane.showMessageDialog(null, "Първа прогарама на Java");
    }
}
