package o1_ProgrammingByBook.Chapter_1_LetsProgram.a1_CreatingFirstProgram;

import javax.swing.*;

public class ShowMeAWindowApplication {
    /*
    * Започваме изучаването на езика за програмиране Java. Пръвото което ще направим
    * е да напишем малка програма. И въпреки че на практика още нищо не знаем за Java
    * нова няма да ни попречи да напишем първата си прогама
    *
    * Първа програма:
    * Писането на една програма започва с определянено на задачата, която трябва да бъде решена или целта, която
    * трябва да бъде постигната при изпълнението й. Нашата цел е проста: при изпълнението на програмата трябва
    * да се появи далогов прозорец с текстово съобщение. Такава задача се решава изключително лесно. Необходими са
    * само няколко реда код
    *
    * Създаването на програма
    * Тъй като става дума за пръва програма, ще направим така, първо ще създадем  прогарама, ще проверим как
    * се изпълнява и едва след това ще анализираме програмния код.
    */

    public static void main(String[] args) {
        JOptionPane.showMessageDialog(null, "Първа прогарама на Java");
    }

}
